ec2-galera/old/percona-replicate/add_5_2040.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 4 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            93520
        write:                           33400
        other:                           13360
        total:                           140280
    transactions:                        6680   (3.27 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 126920 (62.19 per sec.)
    other operations:                    13360  (6.55 per sec.)

Test execution summary:
    total time:                          2040.7182s
    total number of events:              6680
    total time taken by event execution: 10203.1138
    per-request statistics:
         min:                                 17.96ms
         avg:                               1527.41ms
         max:                               8111.88ms
         approx.  95 percentile:            3174.42ms

Threads fairness:
    events (avg/stddev):           1336.0000/22.93
    execution time (avg/stddev):   2040.6228/0.10