ec2-galera/old/percona-replicate/add_5_240.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 4 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            10444
        write:                           3730
        other:                           1492
        total:                           15666
    transactions:                        746    (3.10 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 14174  (58.88 per sec.)
    other operations:                    1492   (6.20 per sec.)

Test execution summary:
    total time:                          240.7228s
    total number of events:              746
    total time taken by event execution: 1202.8949
    per-request statistics:
         min:                                 22.05ms
         avg:                               1612.46ms
         max:                               6523.54ms
         approx.  95 percentile:            3375.32ms

Threads fairness:
    events (avg/stddev):           149.2000/7.08
    execution time (avg/stddev):   240.5790/0.15